{"config": [{"config": {"input_dtype": "float32", "output_shape": null, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u000btimmynet.py\u00da\b<lambda>$\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "batch_input_shape": [null, 55, 160, 3], "function_type": "lambda", "trainable": true, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"nb_row": 6, "activation": "relu", "activity_regularizer": null, "name": "convolution2d_1", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 6, "W_regularizer": null, "bias": true, "nb_filter": 16, "b_constraint": null, "trainable": true, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "averagepooling2d_1", "strides": [3, 3], "pool_size": [3, 3], "trainable": true, "border_mode": "valid"}, "class_name": "AveragePooling2D"}, {"config": {"nb_row": 6, "activation": "relu", "activity_regularizer": null, "name": "convolution2d_2", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 6, "W_regularizer": null, "bias": true, "nb_filter": 32, "b_constraint": null, "trainable": true, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "averagepooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "AveragePooling2D"}, {"config": {"nb_row": 6, "activation": "relu", "activity_regularizer": null, "name": "convolution2d_3", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 6, "W_regularizer": null, "bias": true, "nb_filter": 64, "b_constraint": null, "trainable": true, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "averagepooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "AveragePooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 3328, "W_regularizer": null, "output_dim": 1024, "bias": true, "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 1024, "W_regularizer": null, "output_dim": 1, "bias": true, "b_constraint": null, "trainable": true}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}