{"config": [{"config": {"output_shape_type": "raw", "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u000btimmynet.py\u00da\b<lambda>$\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 55, 160, 3]}, "class_name": "Lambda"}, {"config": {"nb_col": 6, "b_constraint": null, "border_mode": "same", "W_regularizer": null, "W_constraint": null, "activation": "relu", "b_regularizer": null, "nb_row": 6, "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 16, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "averagepooling2d_1", "strides": [3, 3], "pool_size": [3, 3], "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"nb_col": 6, "b_constraint": null, "border_mode": "same", "W_regularizer": null, "W_constraint": null, "activation": "relu", "b_regularizer": null, "nb_row": 6, "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 32, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "averagepooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"nb_col": 6, "b_constraint": null, "border_mode": "same", "W_regularizer": null, "W_constraint": null, "activation": "relu", "b_regularizer": null, "nb_row": 6, "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "averagepooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "relu", "W_regularizer": null, "output_dim": 1024, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 3328, "name": "dense_1", "W_constraint": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "W_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 1024, "name": "dense_2", "W_constraint": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}